<!-- шаблон 1 -->
<?php include 'header.php'; ?>
<!-- шаблон 2 -->
<?php include 'header2.php'; ?>

<div class="photo-container">
<div class="image_left">
    <img src="gialla_left.png" alt=""> 
</div>
<div class="info-block">
<h1>Regexp</h1>
   <hr>
   <p>Регулярні вирази - це інструмент для роботи зі строками та обробки текстів.
   <br>Основні елементи регулярних виразів включають: </p>
<ul>
  <li><a href="/special_characters.php">спецсимволи</a></li><br>
  <li><a href="/groupies.php">групи</a></li><br>
  <li><a href="/quantifiers.php">квантифікатори</a></li><br>
  <li><a href="/anchors.php">якорі</a></li>
</ul>
<div>
<h1>Якорі</h1>
   <p>
      Якорі в регулярних виразах визначають місце в тексті, де має розпочинатися або закінчуватися певний патерн. 
      Основні якорі включають:
   </p>
 <ul>
      <li> ^ : Вказує на початок рядка.<br>Наприклад, ^abc визначає рядок, який починається з "abc".</li><br>
      <li> $ : Вказує на кінець рядка. <br>Наприклад, xyz$ визначає рядок, який закінчується на "xyz".</li><br>
      <li> \b (границя слова): Вказує на місце, де закінчується слово. <br>
      Наприклад, \bword\b визначає слово "word" як окреме слово, а не частину іншого слова.</li><br>
      <li> \B (не границя слова): Вказує на місце, де слово не закінчується. <br>
      Наприклад, \Bword\B визначає входження "word", яке не є окремим словом</li><br>
      <li> (?=...) : Вказує на місце, де певний патерн слід відповідати, але не споживає символи. <br>
      Наприклад, x(?=y) знайде "x", тільки якщо за ним слідує "y".</li><br>
      <li> (?!...) (негативний погляд вперед): Вказує на місце, де певний патерн не повинен відповідати. <br>
      Наприклад, x(?!y) знайде "x", тільки якщо за ним не слідує "y".</li><br>
  </ul>
</div>
</div>
<div class="image_right">
    <img src="gialla_right.png" alt="">
</div>
</div>