<!-- шаблон 1 -->
<?php include 'header.php'; ?>
<!-- шаблон 2 -->
<?php include 'header2.php'; ?>

<div class="photo-container">
<div class="image_left">
    <img src="gialla_left.png" alt=""> 
</div>
<div class="info-block">
<h1>Regexp</h1>
   <hr>
   <p>Регулярні вирази - це інструмент для роботи зі строками та обробки текстів.
   <br>Основні елементи регулярних виразів включають: </p>
<ul>
  <li><a href="/special_characters.php">спецсимволи</a></li><br>
  <li><a href="/groupies.php">групи</a></li><br>
  <li><a href="/quantifiers.php">квантифікатори</a></li><br>
  <li><a href="/anchors.php">якорі</a></li>
</ul>
<div>
   <h1>Групи</h1>
   <p>
   В регулярних виразах групи дозволяють групувати та об'єднувати частини виразу, 
   щоб застосовувати до них квантифікатори або виконувати інші операції. <br>
   Групи створюються за допомогою круглих дужок ().
   </p>
   <ul>
      <li>
        <h3>Захоплюючі групи (Capturing groups):</h3>
        <p>
            Це тип груп, які зберігають зібрані в них дані для подальшого використання.  
            Наприклад, якщо використовувати зібрані дані в іншій частині регулярного виразу або в результаті пошуку. 
            
        </p>
      </li> 
      <li>
        <h3>Незахоплюючі групи (Non-capturing groups):</h3>
        <p>
            Це групи, які використовуються для групування, але не зберігають зібрані дані для подальшого використання. 
        </p>
      </li> 
      <li>
        <h3>Іменовані групи (Named groups):</h3>
        <p>
            Це групи, які мають ім'я і дозволяють присвоювати ім'я групі замість використання її порядкового номера. 
        </p>
      </li> 
      <li>
        <h3>Внутрішні групи (Nested groups):</h3>
        <p>
            Для створення вкладених груп в середині інших груп. Це може бути корисно для складних виразів.
        </p>
      </li> 
   </ul>
</div>
</div>
<div class="image_right">
    <img src="gialla_right.png" alt="">
</div>
</div>

