<!-- шаблон 1 -->
<?php include 'header.php'; ?>
<!-- шаблон 2 -->
<?php include 'header2.php'; ?>

<div class="photo-container">
<div class="image_left">
    <img src="gialla_left.png" alt=""> 
</div>
<div class="info-block">
<h1>Regexp</h1>
   <hr>
   <p>Регулярні вирази - це інструмент для роботи зі строками та обробки текстів.
   <br>Основні елементи регулярних виразів включають: </p>
<ul>
  <li><a href="/special_characters.php">спецсимволи</a></li><br>
  <li><a href="/groupies.php">групи</a></li><br>
  <li><a href="/quantifiers.php">квантифікатори</a></li><br>
  <li><a href="/anchors.php">якорі</a></li>
</ul>
<div>
   <h1>Спецсимволи</h1>
   <p>
       Спеціальні символи в регулярних виразах використовуються для пошуку та визначення текстових шаблонів.
   </p>
   
   <ul>
      <li> . : Представляє будь-який символ, окрім нового рядка.</li><br>
      <li> ^ : Позначає початок рядка.</li><br>
      <li> $ : Позначає кінець рядка.</li><br>
      <li> * : Вказує, що попередній символ може повторюватися нуль або більше разів.</li><br>
      <li> + : Вказує, що попередній символ повинен повторюватися один або більше разів.</li><br>
      <li> ? : Робить попередній символ необов'язковим (може бути відсутнім або зустрічатися один раз).</li><br>
      <li> [] : Визначає клас символів, тобто набір символів, серед яких може знаходитися один символ</li><br>
      <li> |  : Вказує альтернативу, тобто один або інший варіант.</li><br>
      <li> () : Визначають групу символів. Дозволяють застосовувати квантифікатори до цілої групи.</li><br>
      <li> \  : Екранує спеціальні символи, якщо ви хочете використовувати їх як звичайні символи.</li><br>
      <li> \d, \w, \s: Представляють відповідно цифри, слова та пробіли.</li><br>
      <li> \D, \W, \S: Представляють відповідно нецифрові символи, несловесні символи та не пробіли.</li><br>
  </ul>
   
</div>
</div>
<div class="image_right">
    <img src="gialla_right.png" alt="">
</div>
</div>

<!-- <div>
   <h1>special_characters.php</h1>
</div> -->
